---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyInstance..::..Room Property
FamilyInstance Class See Also Send Feedback
---

The room in which the instance is located.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Room | The room in which the instance is located (during the last phase of the project). |
|  | [Room[([( Phase])]) ](5c1ed572-e744-3ab6-9b10-bb258a66f23a.md) |  |

# See Also

FamilyInstance Class

FamilyInstance Members

Autodesk.Revit.DB Namespace